In [1]:
import pandas as pd

# Exercises

## Attendance Data

Load the attendance.csv file and calculate an attendnace percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [31]:
attendance = pd.read_csv('attendance.csv')
attendance.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [32]:
attendance = attendance.rename(columns={'Unnamed: 0': 'name'})

In [33]:
attendance = attendance.melt(id_vars=['name'], var_name='date', value_name='attendance')
attendance.head()

    name        date attendance
0  Sally  2018-01-01          P
1   Jane  2018-01-01          A
2  Billy  2018-01-01          A
3   John  2018-01-01          P
4  Sally  2018-01-02          T

In [34]:
attendance.attendance.value_counts()

T    14
P     9
A     6
H     3
Name: attendance, dtype: int64

In [37]:
attendance['score'] = attendance.attendance.map({'P': 1, 'A': 0, 'T': .9, 'H': .5})

In [43]:
attendance.head()

    name        date attendance  score
0  Sally  2018-01-01          P    1.0
1   Jane  2018-01-01          A    0.0
2  Billy  2018-01-01          A    0.0
3   John  2018-01-01          P    1.0
4  Sally  2018-01-02          T    0.9

In [41]:
attendance.groupby(by='name').mean()

        score
name
Billy  0.5250
Jane   0.6875
John   0.9125
Sally  0.7625

## Coffee Levels

a. Read the coffee_levels.csv file.


b. Transform the data so that each carafe is in it's own column.


c. Is this the best shape for the data?

In [47]:
coffee = pd.read_csv('coffee_levels.csv')
coffee.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [48]:
coffee.coffee_carafe.value_counts()

x    10
z    10
y    10
Name: coffee_carafe, dtype: int64

In [50]:
coffee = coffee.pivot_table(values='coffee_amount', index='hour', columns='coffee_carafe')
coffee.head()

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947

<font color=green>This is not the best shape for the data.</font>

## Cake Recipes

a. Read the cake_recipes.csv data. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.


b. Tidy the data as necessary.


c. Which recipe, on average, is the best? recipe b


d. Which oven temperature, on average, produces the best results? 275


e. Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [81]:
cake = pd.read_csv('cake_recipes.csv')
cake.head()

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [82]:
cake['recipe'] = cake['recipe:position'].str.extract(r'(\D)')

In [83]:
cake.head(1)

  recipe:position        225        250       275        300 recipe
0        a:bottom  61.738655  53.912627  74.41473  98.786784      a

In [84]:
cake['position'] = cake['recipe:position'].str.extract(r':(.*)')

In [85]:
cake.head(1)

  recipe:position        225        250       275        300 recipe position
0        a:bottom  61.738655  53.912627  74.41473  98.786784      a   bottom

In [86]:
cake = cake.drop(columns='recipe:position')

In [87]:
cake

         225        250        275        300 recipe position
0  61.738655  53.912627  74.414730  98.786784      a   bottom
1  51.709751  52.009735  68.576858  50.228470      a      top
2  57.095320  61.904369  61.196980  99.248541      b   bottom
3  82.455004  95.224151  98.594881  58.169349      b      top
4  96.470207  52.001358  92.893227  65.473084      c   bottom
5  71.306308  82.795477  92.098049  53.960273      c      top
6  52.799753  58.670419  51.747686  56.183110      d   bottom
7  96.873178  76.101363  59.571620  50.971626      d      top

In [103]:
cake = cake.melt(id_vars=['recipe', 'position'], var_name='temp', value_name='score')

In [104]:
cake.head()

  recipe position temp      score
0      a   bottom  225  61.738655
1      a      top  225  51.709751
2      b   bottom  225  57.095320
3      b      top  225  82.455004
4      c   bottom  225  96.470207

<font color=green>**Recipe b is the best scoring on average.**</font>

In [112]:
cake.groupby(by='recipe').mean()

            score
recipe
a       63.922201
b       76.736074
c       75.874748
d       62.864844

<font color=green>**Oven temp of 275 gets the best score on average.**</font>

In [106]:
cake.groupby(by='temp').mean()

          score
temp
225   71.306022
250   66.577437
275   74.886754
300   66.627655

<font color=green>**Oven recipe b, temp of 300, bottom rack gets the best score on average.**</font>

In [110]:
cake.groupby(by=['recipe', 'position', 'temp']).mean().idxmax()

score    (b, bottom, 300)
dtype: object